examples/render_all_grammars/dot/tests_functional_test_scoping_metamodel_provider_Users.dot
    digraph xtext {
    fontname = "Bitstream Vera Sans"
    fontsize = 8
    node[
        shape=record,
        style=filled,
        fillcolor=aliceblue
    ]
    nodesep = 0.3
    edge[dir=black,arrowtail=empty]


40181032[ label="{Model|}"]

40276968[ label="{User|+name:ID\l}"]

40281912[ label="{Import|+importURI:STRING\l}"]

37556216[ label="{ID|}"]

39962872[ label="{STRING|}"]

40035496[ label="{BOOL|}"]

40169960[ label="{INT|}"]

40186568[ label="{FLOAT|}"]

40118552[ label="{STRICTFLOAT|}"]

40207832[ label="{NUMBER|}"]

40216232[ label="{BASETYPE|}"]

40221768[ label="{*OBJECT|}"]

40164424[ label="{Model|}"]

39827768[ label="{Package|+name:ID\l}"]

39942808[ label="{Interface|+name:ID\l}"]

40226136[ label="{Component|+name:ID\l}"]

40230856[ label="{*Slot|}"]

40245704[ label="{SlotIn|+name:ID\l}"]

40251240[ label="{SlotOut|+name:ID\l}"]

40256776[ label="{Instance|+name:ID\l}"]

40262312[ label="{Connection|}"]

40267848[ label="{FQN|FQN}"]

40206360[ label="{Comment|\\/\\/.*$}"]



40181032 -> 40281912[arrowtail=diamond, dir=both, headlabel="imports 1..*"]
40181032 -> 40276968[arrowtail=diamond, dir=both, headlabel="users 1..*"]
40276968 -> 40256776[headlabel="instance "]
40207832 -> 40118552 [dir=back]
40207832 -> 40169960 [dir=back]
40216232 -> 40207832 [dir=back]
40216232 -> 40186568 [dir=back]
40216232 -> 40035496 [dir=back]
40216232 -> 37556216 [dir=back]
40216232 -> 39962872 [dir=back]
40221768 -> 40216232 [dir=back]
40164424 -> 39827768[arrowtail=diamond, dir=both, headlabel="packages 0..*"]
39827768 -> 40226136[arrowtail=diamond, dir=both, headlabel="components 1..*"]
39827768 -> 40256776[arrowtail=diamond, dir=both, headlabel="instances 1..*"]
39827768 -> 40262312[arrowtail=diamond, dir=both, headlabel="connections 1..*"]
39827768 -> 39827768[arrowtail=diamond, dir=both, headlabel="packages 1..*"]
39827768 -> 39942808[arrowtail=diamond, dir=both, headlabel="interfaces 1..*"]
40226136 -> 40226136[headlabel="extends 1..*"]
40226136 -> 40230856[arrowtail=diamond, dir=both, headlabel="slots 0..*"]
40230856 -> 40245704 [dir=back]
40230856 -> 40251240 [dir=back]
40245704 -> 39942808[headlabel="formats 1..*"]
40251240 -> 39942808[headlabel="formats 1..*"]
40256776 -> 40226136[headlabel="component "]
40262312 -> 40256776[headlabel="from_inst "]
40262312 -> 40251240[headlabel="from_port "]
40262312 -> 40256776[headlabel="to_inst "]
40262312 -> 40245704[headlabel="to_port "]

}
